routes/web.php

*/

// need to create a controller for these maybe Main or FrontendController
Route::get('/', function () {
    $posts = Post::where('category_id', '=', '1')->latest()->limit(5)->get();
    $partners = Partner::all();
    return view('new')
                ->with('posts', $posts)
                ->with('partners', $partners);
});
---
select * from `tfc_posts` where `category_id` = '1' order by `created_at` desc limit 5
select * from `tfc_partners`