app/Http/Controllers/Teacher/NotificationController.php

select * from `tfc_teachers` where `id` = '4' limit 1
---
    public function delete(Request $request)
    {
        $notification = Auth::guard('teacher')->user()->notifications()->where('id', $request['id'])->first()->delete();