app/Http/Controllers/Admin/Apps/VideoController.php

    public function uploadVideo(Request $r)
    {

      $utility = new Utility;

      $file = $r['video'];
      $filename = pathinfo($r['video']->getClientOriginalName(), PATHINFO_FILENAME);
      $ext = $r['video']->getClientOriginalExtension();

      $check = $utility->verifyExt($ext, ['video']);
      // $check = true;

      $pavilion = AppSection::find($r->section);
      $app_category = AppCategory::find($r->app_category);
      $app_name = App::find($r->app_name);
---
select * from `tfc_app_sections` where `tfc_app_sections`.`id` = '1' limit 1
select * from `tfc_app_categories` where `tfc_app_categories`.`id` = '2' limit 1
select * from `tfc_apps` where `tfc_apps`.`id` = '4' limit 1

        $video->img = $library['img'];
        $video->src = $library['src'];
        $video->duration = $library['duration'];
        $video->save();
---
insert into `tfc_videos` (`title`, `category_id`, `img`, `src`, `duration`, `updated_at`, `created_at`) values ('Intercut-At eye 2', '2', 'apps/library/film-specific/editing/parallel-action/app/At eye 2-thumb.jpg', 'apps/library/film-specific/editing/parallel-action/app/At eye 2.mp4', '20', '2017-10-17 14:01:30', '2017-10-17 14:01:30')

    public function getRelations(string $type, $id)
    {
        switch ($type) {
          case 'pavilion':
              $section = AppSection::find($id);
              $categories = $section->appCategories()->get();
              $apps = collect();

              foreach ($categories as $key => $category) {
                $items = $category->apps()->get();
                foreach ($items as $key => $app) {
                  $apps->push($app);
                }
              }

              $data = [
                'categories' => $categories,
                'apps' => $apps
              ];

              return response()->json($data, 200);
            break;

          case 'category':
              $category = AppCategory::find($id);
              $section = $category->section()->first();
              $apps = $category->apps()->get();
---
select * from `tfc_app_sections` where `tfc_app_sections`.`id` = '1' limit 1
select * from `tfc_app_categories` where `tfc_app_categories`.`app_section_id` = '1' and `tfc_app_categories`.`app_section_id` is not null
select * from `tfc_app_categories` where `tfc_app_categories`.`id` = '2' limit 1

            break;

          case 'app':
              $app = App::find($id);
---
select * from `tfc_apps` where `tfc_apps`.`id` = '4' limit 1